init:
    # на сколько увеличивать
    $ zo = 1.05
    # за какое время
    $ t_delay = .25

    # перемещение и изменение размера
    transform t_on(xa=.5, z=zo, delay=t_delay):
        align (xa, 1.0) zoom 1.00001 anchor (.5, 1.0)
        easein delay zoom z

    transform t_off(xa=.5, z=zo, delay=t_delay):
        align (xa, 1.0) zoom z anchor (.5, 1.0)
        easeout delay zoom 1.00001
#window_background=""
    define i = Character ('Увядающее Тело', color="#8a8a8a")
    define g = Character ('Гиря', color="#062C06")
    define c = Character ('Отцовские часы', color="#AC4C4C")
    define n = Character ('Забвенная Записная книжка', color="#F4FA1C")
    define h = Character ('Эпатажная шляпа', color="#A05B1B")
    define m = Character ('Менеджер', color="#FF0000")
    define a = Character ('Анна', color="#00E5FF")
    define f = Character ('Опустошенный Холодильник', color="#80C8BA")
    define p = Character ('Сиплый телефон', color="#D380DA")
    define x = Character ('Обреченное тело', color="#8a8a8a")
    define y = Character ('и ', color="#8a8a8a")

#переменные
define hatmad = False
define hat_lost = False
define anna_love = False
define getjob = False

init python:
    # высветление
    def show_on(char, xa=.5, z=zo, delay=t_delay):
        renpy.show(char, at_list=[t_on(xa, z, delay)])
    # затемнение
    def show_off(char, xa=.5, z=zo, delay=t_delay):
        renpy.show(char, what=im.MatrixColor(char + ".png", im.matrix.saturation(.15)), at_list=[t_off(xa, z, delay)])
    # убрать персонажа/персонажей с экрана
    def hide_char(*args):
        for i in args:
            renpy.hide(i)


# Игра начинается здесь:
# ЗВУКИ ДОЖДЯ
label start:
    play sound rain
    scene bg divan
    $ show_on("gs", .75) # цветной и увеличенный тот, кто говорит
    $ show_off("g1", .25) # молчащего красим в серый т уменьшаем до нормальной величины
    i "В этом чертовом городе всегда идет дождь?"
    i "Если бы не ты я бы добежал быстрее и не промок."
    $ show_off("gs", .75) # молчащего красим в серый т уменьшаем до нормальной величины
    $ show_on("g1", .25) # цветной и увеличенный тот, кто говорит
    g "Ты винишь меня во всех своих злоключениях…"
    g "Ничего, я потерплю если тебе так становится проще."
    $ show_on("gs", .75) # молчащего красим в серый т уменьшаем до нормальной величины
    $ show_off("g1", .25) # цветной и увеличенный тот, кто говорит
    i "Они не перезвонят, я уже миллион раз видел такой взгляд."
    i "'Да-да, выметайся уже поскорее, еще кучу таких как ты надо отшить, преждем чем можно будет идти домой.'"
    $ show_off("gs", .75) # молчащего красим в серый т уменьшаем до нормальной величины
    $ show_on("g1", .25) # цветной и увеличенный тот, кто говорит
    g "Тебе не нужна их поганая работа, надо найти что-то, что позволит тебе запереться дома."
    $ show_off("g1", .25) # молчащего красим в серый т уменьшаем до нормальной величины
    $ show_on("gs", .75) # цветной и увеличенный тот, кто говорит
    i "Аргхх, я устал, этот мир поставил мне цуцванг, что не делай, становится хуже, чем вчера."
    $ show_off("gs", .75)
    $ show_on("g1", .25)
    g "Всё хорошо, пока мы можем быть здесь в тепле, одни."
    $ show_off("g1", .25)
    $ show_on("gs", .75)
    i "Мать сказала, что в этом месяце она отправляет мне деньги последний раз." 
    i "Если не найду работу в ближайшее время, всё пропало, я пропал."
    $ show_off("gs", .75)
    $ show_on("g1", .25)
    g "Не верю! Не верю что она тебя просто бросит вот так"
    $ hide_char("g1")
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    c "Вы просто жалкие, слушать вас сущее мучение. Твой отец будь рассмеялся бы над тобой."
    c "Только сидишь и скулишь как шавка какая."
    c "Сделай уже что-нибудь, вложись в акции, открой свой бизнес, пройди курсы адвокатуры."
    c "Столько возможностей проходит мимо, пока ты бесцельно пялешься в потолок."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "Ну ты прав, лежать так просто не дело."
    i "Нужно пожевать чего."
    $ hide_char("w1")
    $ show_off("gs", .75)
    f "Ты правда подумал, что найдешь здесь что-то съедобное?" 
    f "Совсем спятил. Ты используешь меня исключительно в качестве подставки для бутылок последние пару лет." 
    f "Я пустой, вечно пустой! Я уже забыл, какого это иметь внутри еду... о это далекое дивное чувство!"
    $ show_on("gs", .75)
    i "Не дребезжи, вон я вижу что-то, так-так давай это сюда!"
    $ show_off("gs", .75)
    f "Да ты шутишь! Не говори мне, что собираешься это съесть." 
    f "Я даже не помню как оно выглядело и чем являлось раньше до того, как испортиться в первый раз."
    $ show_on("gs", .75)
    i "Не драматизируй, я всеядный, а это моё все"
    $ show_on("g1", .25)
    $ show_off("gs", .75)
    g "Мне больно осозновать, но завтра нужно сходить за покупками, только недалеко… и сразу же назад."
    $ show_on("gs", .75)
    $ show_off("g1", .25)
    i "Сходить говорит! Да ты хоть представляешь как утомительно волочить тебя по земле каждый раз."     
    i "Раньше ты был не таким тяжелым."
    i "Как мне вообще искать работу с такой обузой."
    i "Ты портишь мне жизнь, ведёшь меня на эшафот, что тебе от вообще нужно, сколько это будет продолжаться."
    $ show_on("g1", .25)
    $ show_off("gs", .75)
    g "Какими грубостями ты меня обливаешь, это тебе нужен я, а не наоборот."
    g "без меня где бы ты был уже? На дне реки или, скорее, бутылки?"
    $ hide_char("g1")
    $ show_on("w1", .25)
    c "Не слушай его, с самого момента его появления всё идет по низходящему тренду."
    $ hide_char("w1")
    $ show_on("g1", .25)
    g "Зачем тебе вообще искать работу. Ты можешь продать часы, они точно стоят кучу денег."
    g "А дальше… дальше всё само как-нибудь наладится."
    $ show_on("gs", .75)
    $ show_off("g1", .25)
    i "Забудь, это подарок отца в честь выпуска, семейная реликвия, считай." 
    i "Он с того света явится и вытрясет из меня душу за такое."
    $ hide_char("g1")
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    c "Хотя бы что-то человеческое в тебе осталось."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "Всё замолчите, я хочу спать, спать и не просыпаться."
    $ show_off("gs", .75)
    scene black with dissolve
#ЗАТЕМНЕНИЕ ФОНА
#СНОВА ДИВАН
    scene bg divan
    $ show_on("gs", .75)
    i "Скажите мне, что прошла уже тысяча лет, и людям больше не нужно работать, и желательно  двигаться."
    $ show_off("gs", .75)
    $ show_on("g1", .25)
    g "Это было бы прекрасное будущее"
    $ show_on("gs", .75)
    $ show_off("g1", .25)
    i "Во сне было так легко…"
    $ hide_char("g1")
    f "Я не прощу тебя, если ты вернешься с пустыми руками или с пакетом грохочащего стекла."
    $ show_on("n1", .25)
    n "Ты алчный кусок холодного металла, человек должен думать о сытости духовной, а не как бы набить брюхо."
    $ show_off("n1", .25)
    $ show_on("gs", .75)
    i "О, это же мой творческий блокнот, когда-то я всегда носил тебя с собой, записывал свои идеи, стихотворения."
    i "Я думал, что потерял тебя уже лет сто назад."
    $ show_off("gs", .75)
    $ hide_char("n1")
    f "Положи его обратно, а лучше закинь подальше."
    f "Он только трепаться и горазд, а нам жратва нужна, ЖРАТВА!"
    $ show_on("gs", .75)
    i "Всё, иду я иду, "
    "Может быть, если бы ты по ночам не мешал мне спать своим рычанием, я бы чаще к тебе прислушивался."
    $ hide_char("n1")
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    stop sound
    c "Не злись так на него, с момента как его собрали, две страны уже рухнуло, а он всё еще пашет."
    $ hide_char("w1")
    $ show_on("h1", .25)
    h "Хэй, босс. Решил проветриться, это круто. Сегодня довольно солнечно, цепляй меня и погнали."
    $ show_off("h1", .25)
    $ show_on("gs", .75)
    i "Ты не подходишь такой развалине, я и храню тебя то как напоминание о своей молодости."
    $ show_off("gs", .75)
    $ show_on("h1", .25)
    h "Брехня, ты еще не истлел, стряхни только пыль с меня и полетели/"
    $ show_off("h1", .25)
    $ show_on("gs", .75)
    i "Ты видишь, что у меня на ноге? С такой штукой не полетаешь."
    i "Так, лучше скажи, сколько там у меня деньжат осталось?"
    $ show_off("gs", .75)
    $ show_on("h1", .25)
    h "Эй, эй я тебе копилка что ли? На то чтобы взорвать разок - точно хватит!"
    $ show_off("h1", .25)
    $ show_on("gs", .75)
    i "Деньги взял, телефон взял, ключи…."
    $ show_off("gs", .75)
    $ hide_char("h1")
    "Внутри меня засело какое-то тревожное чувство, будто я что-то забыл, мне нужно унять его, иначе я не смогу выйти наружу."
    label choise1:
    menu:
    
        "Надеть шляпу":
            $ show_on("h1", .26)
            h "Hell yeah baby! Давненько мы не отрывались, эта красотка уже вечером будет у наших ног."
            $ show_off("h1", .25)
            #ЗВУК ДВЕРИ
            play sound door_close
            jump hat1
            
        "Взять блокнот": 
            $ show_on("n1", .25)
            n "Каждый твой выход на улицу - это событие, которое должно быть задокументировано, выдолблено в мраморе…. ну или в бумаге."
            $ show_off("n1", .25)
            $ anna_love = True
            play sound door_close
            jump notepad1
             #ЗВУК ДВЕРИ
            
        "Надеть отцовские часы":
            $ show_on("w1", .25)
            c "Отлично, купим в магазине поблизости, продадим на рынке с наценкой, затем возьмем в долг еще партию побольше, так пока не выйдем на серьезные масштабы."
            $ show_off("w1", .25)
            play sound door_close
            jump clock1
             #ЗВУК ДВЕРИ
            

label notepad1:
scene black with dissolve
#ЗАТЕМНЕНИЕ ФОНА
#УЛИЦА ФОН
scene bg street
$ show_on("g1", .25)
g "Мне здесь не нравится, может произойти всё что угодно. Нужно было попросить кого-нибудь принести еды."
$ hide_char("g1")
$ show_on("n1", .25)
n "Я шел по узким городским улицам столь привычным для прохожих, что они даже не замечают изменений вокруг."
n "Не замечают меня, растворенного в городском пейзаже."
$ show_off("n1", .25)
$ show_on("gs", .75)
i "Я шел в магазин, запятая, а потом пойду домой, точка."
$ show_off("gs", .75)
$ show_on("n1", .25)
n "Важность моей миссии была бесконечна, ибо от неё завесила моя жизнь"
"...."
$ hide_char("n1")
$ show_on("gis", .25)
a "Ой, прошу прощения, Вы в порядке."
a "Ох, неужели это ты?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Анна?"
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Да, ну точно ты, невероятно. Я думала, ты переехал! Кого не спрашивала, никто не знает, что ты да как."
$ hide_char("gis")
$ show_on("g1", .25)
g "Ты её знаешь? Такая ухоженная, такая яркая... откуда такому как ты её знать."
$ hide_char("g1")
$ show_on("n1", .25)
n "Ну конечно знает, у меня даже стихотворение есть:"
"""Ах, Анна, Анна, но как же так случилось,
Что мысли все мои лишь только о тебе,
Ах, Анна, Анна, неужто мне приснилось,
Как…"""
$ show_off("n1", .25)
$ show_on("gs", .75)
i "НЕ СМЕЙ ПРОДОЛЖАТЬ, А ТО Я ТЕБЯ ВМЕСТО ТУАЛЕТНОЙ БУМАГИ ИСПОЛЬЗУЮ."
$ hide_char("n1")
$ show_off("gs", .75)
$ show_on("g1", .25)
g "Не отвечай ей, сделай вид, что обозналась."
$ hide_char("g1")
$ show_on("gis", .25)
a "Тук-тук, здесь есть кто-нибудь?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Хах, ахахах, прости, просто я поражен тем, как ты изменилась."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "И как же?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Стала еще прекраснее, мне нравится твой новый стиль."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Мммм, ты всё так же мил как и раньше."
a "Слушай, у меня как раз есть свободное время, я шла выпить кофе, не хочешь со мной?"
a "Ну… если ты не занят, конечно."
$ hide_char("gis")
$ show_on("g1", .25)
g "Я ПРОТЕСТУЮ!"
g "куда, куда, куда…. в незнакомое место… Ты же её не видел уже столько лет, она красотка, а ты на себя посмотри."
$ show_on("n1", .25)
n "Внешне она выглядит иначе, но я уверен, что она всё та же добрая, веселая Анна, которая вытирала салфеткой крем от эклера у тебя со щеки во время обеда и так звонко хихикала при это."
$ show_off("n1", .25)
$ show_on("gs", .75)
i "С радостью, я тут просто прогуливаюсь за покупками."
'''
{color=#0EA3C9}"Не так уж много почти окрыленных шагов спустя."
'''
scene bg cafe
 #КАФЕХА ФОН
$ show_on("gis", .25)
a "Так ты живешь где-то неподалеку."
$ show_off("gis", .25)
$ show_on("gs", .75)
i  "Да, почти сразу же за углом снимаю студию"
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Ух ты, тут такие милые домики, наверное, она очень уютная."
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Была, пока в ней не поселился я."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Ты всегда был неряхой тем ещё, хе-хе."
a "Надо же, столько лет прошло, а ты почти не изменился."
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Это получается, что я стою на месте?"
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Нет, я не в плохом смысле."
a "Просто все в моём окружении стали такими душными, постоянно говорят о делах."
a "Даже время свободное провести не с кем, потому я обычно и хожу сюда одна."
a "Но рядом с тобой я этого не чувствую, с тобой как и раньше можно поговорить о другом."
$ hide_char("gis")
$ show_on("n1", .25)
n "Ваша связь с годами не ослабла, она и правда скучает по вашему общению."
$ hide_char("n1")
$ show_on("gis", .25)
a "Мы тут так заседелись, пора уже идти."
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Было приятно встретить тебя после стольких лет."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Ммм, а что это у тебя записная книжка."
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Хех, да, тоже со времен университета еще, почитать не дам и посомтреть тоеж!"
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Секретики-секретики, хе-хе."
a "Ну а для моего телефона там место найдется?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Ну если только где-нибудь с краю."
$ hide_char("gis")
$ show_on("n1", .25)
$ show_off("gs", .75)
n "Половина страниц пустует и желтеет за ненадобностью."
n "Можешь писать хоть по цифре на страницу!"
$ show_off("n1", .25)
'''
{color=#0EA3C9}11 неразборчиво выведенных закорючек спустя.
'''
$ hide_char("n1")
$ show_on("g1", .25)
g "Ты вообще в меню заглядывал? Мы разорены!"
$ hide_char("g1")
$ show_on("gis", .25)
a "О, не переживай, я заплачу, всё-таки я тебя пригласила."
$ hide_char("gis")
$ show_on("g1", .25)
g "Я же говорил, она думает, что ты нищеброд вонючий, решила угостить тебя сладким из жалости."
$ show_off("g1", .25)
$ show_on("gs", .75)
i "Ты же не думаешь, что я сам за себя заплатить не могу…"
$ hide_char("g1")
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Конечно, нет. Но если хочешь вернуть мне должок, придется встретиться еще раз."
$ hide_char("gis")
$ show_on("g1", .25)
g "Не позволяй ей тобой манипулировать, очевидно, что она хочет от тебя чего-то."
$ hide_char("g1")
$ show_on("n1", .25)
n "Абсурд не иначе. У тебя нет ничего кроме драгоценного, но поблекшего камня души. Который сиять лишь может будучи другому преподнесённым."
$ hide_char("n1")
$ show_on("gis", .25)
a "Пока-пока."
scene bg street
  #УЛИЦА ФОН
$ show_on("n1", .25)
n "Будь ты чутким и галантным, мог бы проводить её до дома, но какой уж ты есть."
$ hide_char("n1")
$ show_on("g1", .25)
g "Пускай лучше проводит себя до нашего дома."
$ show_off("g1", .25)
$ show_on("gs", .75)
i "Еще не поздно купить продуктов."
$ show_off("gs", .75)
jump event_job


label hat1:
      #ТЕМНЫЙ ФОН
        scene black with dissolve
        $ show_on("gs", .75)
        i "Ладно, ты и правда уже запылился тут."
        $ show_off("gs", .75)
        $ show_on("h1", .25)
        h "Ты не пожалеешь, ковбой."
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Охлади свой пыл, мы только в магазин и обратно."
        $ hide_char("h1")
        $ show_off("gs", .75)
        $ show_on("g1", .25)
        g "Зря ты его взял, поверь мне, опять ввяжешься в историю."
        scene bg street
  #УЛИЦА ФОН
        $ show_on("h1", .25)
        h "Палящие солнце, ритм мегаполиса, как я соскучился по всему этому."
        h "Столько всего происходит вокруг, может быть, и с нами произойдёт что-то?"
        $ hide_char("h1")
        $ show_on("g1", .25)
        g "И не надейся, скоро мы уже будем дома, скором будем дома, скоро будем…"
        $ hide_char("g1")
        $ show_on("h1", .25)
        h "Эй, босс, скажи зачем ты эту тяжеленную штуку с собой таскаешь?"
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Как будто я по своей воли это делаю, тебя я могу снять и положить на полку до лучших времен, а это… Это преследует меня повсюду."
        $ hide_char("h1")
        $ show_on("gis", .25)
        a "Ай, прошу прощения."
        $ show_off("gis", .25)
        $ show_on("gs", .75)
        i "Всё в порядке..."
        $ show_off("gs", .75)
        $ show_on("gis", .25)
        a "Мммм, неужели это ты!"
        $ show_off("gis", .25)
        $ show_on("gs", .75)
        i "Ты... ты ведь Анна?"
        $ show_off("gs", .75)
        $ show_on("gis", .25)
        a "Бинго!"
        a "Ах, подожди, это у тебя в руках та самая легендарная шляпа?"
        $ hide_char("gis")
        $ show_on("h1", .25)
        h "Она самая детка, я знал, что моя слава ещё не померкла."
        $ hide_char("h1")
        $ show_on("g1", .25)
        g "Отдай ей шляпу как сувенир из прошлого и пойдем, мне тревожно."
        $ show_on("gs", .75)
        i "Не такая уж и легендарная."
        $ hide_char("g1")
        $ show_off("gs", .75)
        $ show_on("gis", .25)
        a "Еще какая! Ты ведь выиграл её в покер у самого декана во время празднования юбилея университета."
        a "Я думала он скорее съест её, чем тебе отдаст."
        $ hide_char("gis")
        $ show_on("h1", .25)
        h "Мне этот старый маразматик никогда не нравился, это так к слову."
        h "Лысина его потела чудовищно просто."
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "А что ты здесь делаешь, кстати говоря?"
        $ hide_char("h1")
        $ show_on("gis", .25)
        $ show_off("gs", .75)
        a "Это мои слова, я то тут работаю, а вот ты…"
        a "Столько лет ни слуху ни духу, я думала, ты в родной город решил вернуться."
        $ hide_char("gis")
        $ show_on("h1", .25)
        h "Какой вернуться, мадам. Ковбой идёт только вперед."
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Я еще с этим городом не закончил."
        $ hide_char("h1")
        $ show_on("gis", .25)
        $ show_off("gs", .75)
        a "Рада, что твой огонь ещё не погас."
        a "Слушай, у меня как раз есть свободное время, я шла выпить кофе, не хочешь со мной?"
        a "Ну… если ты не занят, конечно."
        $ hide_char("gis")
        $ show_on("g1", .25)
        g "Я ПРОТЕСТУЮ!"
        g "куда, куда, куда…. в незнакомое место… Ты же её не видел уже столько лет, она красотка, а ты на себя посмотри."
        $ hide_char("g1")
        $ show_on("n1", .25)
        n "Внешне она выглядит иначе, но я уверен, что она всё та же добрая, веселая Анна, которая вытирала салфеткой крем от эклера у тебя со щеки во время обеда и так звонко хихикала при это."
        $ show_off("n1", .25)
        $ show_on("gs", .75)
        i "С радостью, я тут просто шатаюсь без дела, ищу чем заняться."
        $ show_off("gs", .75)
        '''
        {color=#0EA3C9}"Не так уж много шагов спустя."
        '''
        scene bg cafe
          #КАФЕХА ФОН
        $ show_on("gis", .25)
        a "Уютно здесь правда, моё любимое место."
        $ hide_char("gis")
        $ show_on("h1", .25)
        h "Слишком спокойно, шороху не наведешь."
        $ hide_char("h1")
        $ show_on("gis", .25)
        a "Так, я пожалуй возьму себе ванильный латте на кокосовом молоке и фирменный чизкейк. Рекомендую, выпечка у них здесь просто класс."
        $ hide_char("gis")
        $ show_on("h1", .25)
        h "Тебе бы текиллы взять для начала, а не вот это всё."
        $ hide_char("h1")
        $ show_on("gis", .25)
        a "У меня есть свой стиль, я возьму себе фламбе и двойной эспрессо."
        $ show_off("gis", .25)
        '''
        {color=#0EA3C9}"Спустя два выпитых кофе."
        '''
        $ hide_char("gis")
        $ show_on("g1", .25)
        g "Мы влипли, мы так влипли, боюсь даже представить сколько денег ты потратил."
        g "Что ты потом делать будешь?"

        $ hide_char("g1")
        $ show_on("h1", .25)
        h "Брехня, кто же деньги считает в кафе с такой чумовой цыпой."
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Слушай, не хочешь прогуляться?"
        i "Просто выпить кофе мне недостаточно после стольких лет разлуки."
        $ hide_char("h1")
        $ show_off("gs", .75)
        $ show_on("gis", .25)
        a "Мой вечер в твоём распоряжении."
        $ hide_char("gis")
        $ show_on("h1", .25)
        h "Вот это выстрел меткий, достойно."
        $ hide_char("h1")
        $ show_on("g1", .25)
        g "Катастрофа! Ты что же еще за неё и заплатил? ЕЩЕ И ОФИЦИАНТУ НА ЧАЙ ОСТАВИЛ, СКОЛЬКО ОСТАВИЛ?"
        g "Да ты же нищий! Будешь завтра варить кашу из отвалившейся со стен штукатурки."
        $ hide_char("g1")
        $ show_on("h1", .25)
        h "Не сбавляй темпа, амиго. Сегодня она точно станет твоей."
        scene bg street
          #УЛИЦА ФОН
        $ show_on("g1", .25)
        g "Шумно, здесь так шумно, столько людей, домой, скорее домой!"
        $ hide_char("g1")
        $ show_on("h1", .25)
        h "Подожди, ни в коем случае, никаких домой. Такой шанс, пригласи её в бар, всё так гладко идет."
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Анна, не устала ходить? Ты ведь после работы."
        $ hide_char("h1")
        $ show_on("gis", .25)
        $ show_off("gs", .75)
        a "Ммм... предположим устала, а есть предложения?"
        $ hide_char("gis")
        $ show_on("g1", .25)
        g "Нету, нету у тебя никаких предложений, хотя... Нет есть одно, Можешь предложить ей попращаться!"
        $ hide_char("g1")
        $ show_on("h1", .25)
        h "Ну чего ждешь, действуй!"
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Я не уверен... Я чувствую себя таким уставшим."
        $ show_off("gs", .75)
        $ show_on("h1", .25)
        h "За то я полон сил, давай, надевай меня."
        $ show_off("h1", .25)
        $ show_on("gs", .75)
        i "Что? Да засмеют же. Я и раньше не без смущения шляпу носил. и вообще, я без понятия зачем тебя с собой взял."
        $ show_off("gs", .75)
        $ show_on("h1", .25)
        h "Засмеют? Да я весь город на уши поставлю, а эту красотку посажу тебе на колени."
        h "Такой момент, такая встреча, нужно только еще немного нажать на педаль."
        $ hide_char("h1")
        $ show_on("g1", .25)
        g "Чтобы оказаться в овраге! Он угробит тебя, столько раз пытался, ты только вспомни, Я прошу тебя, пошли домой, купим еды и пойдем домой, и так столько денег уже потратили, так и правда придется побираться ходить скоро"
        $ hide_char("g1")
label choise1_5:
        menu:
          
            "Нацепить шляпу и устроить рок-н-ролл":
                $ hatmad = True
                $ hat_lost = True
                $ show_on("gs", .75)
                i "Может быть, в этот раз всё пройдет не как обычно."
                i "Детка, сегодня мы идем в бар и напьемся как раньше в хлам, и будет нам весело как Греческим Богам."
                $ show_off("gs", .75)
                $ show_on("gis", .25)
                a "Хи-хи, на пару бокалов зайти и правда можно."
                $ show_off("gis", .25)
                jump event_job
            "Нажать на тормоза":
                $ show_on("gs", .75)
                i "Нет уж, я знаю куда ведёт этот путь и идти по нему, а точнее ползти я не хочу"
                i "Эм.. да нет, особых предложений нет."
                $ show_off("gs", .75)
                $ show_on("gis", .25)
                a "Знаешь что? Может, запишишь мой телефон?"
                a "Я бы хотела встретиться еще"
                $ show_off("gis", .25)
                p "Ах, неужели!"
                p "Неужели, я наконец-то смогу вспомнить, какого это звонить другим людям!"
                $ hide_char("gis")
                $ show_on("g1", .25)
                g "Он звонит иногда маме, а она даём ему деньги, и он живет дальше. Это всегда было более чем достаточно."
                $ show_off("g1", .25)
                $ show_on("gs", .75)
                i "Конечно, было бы здорово."
                $ show_off("gs", .75)
                $ hide_char("g1")
                '''
        {color=#0EA3C9}"Спустя 27 неловких нажатий на кнопки спустя"
                '''
                $ show_on("gis", .25)
                a "Ну тогда спокойной ночи, еще увидимся"
                $ show_off("gis", .25)
                $ show_on("gs", .75)
                i "Был рад с тобой повидаться."
                $ hide_char("gis")
                $ show_off("gs", .75)
                $ show_on("h1", .25)
                h "ну-ну, был рад повидаться, а если бы послушал меня, мог бы с ней и не только повидаться, но и покувыркаться."
                $ hide_char("h1")
                $ show_on("g1", .25)
                g "ДОМОЙ, УРА НАКОНЕЦ ДОМОЙ."
                $ show_off("g1", .25)
                $ show_on("gs", .75)
                i "Кажется, мне придется научиться жить без еды."
                $ show_off("gs", .75)
                $ anna_love = True
                jump event_job
            
label event_job:
        scene bg divan
        '''
        {color=#0EA3C9}"Мгновение спустя"
        '''
        if hatmad:
            $ show_on("gs", .75)
            i "Аргхххх, голова…" 
            i "Всё-таки прошло как обычно…"
            i "Что же я такого наделал, я же пару бокалов только выпил."
            $ show_off("gs", .75)
            $ show_on("g1", .25)
            g "Как удобно тебе, что ты не помнишь, я тоже хотел бы забыть."
            g "Это был сущий кошмар."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Рассказывай, давай."
            $ show_off("gs", .75)
            $ show_on("g1", .25)
            g "Уверен? Это может оказаться болезненным, не хочу ранить тебя."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Одна боль, другая... и так башка гудит, давай уже, коли!"
            $ show_off("gs", .75)
            $ show_on("g1", .25)
            g "Ну… ты напялил это гнездо на голову и понеслось…."
            g "Поначалу всё шло неплохо, вы с Анной болтали как в старые времена."
            g "Между вами даже была какая-то химия."
            g "Вы уже почти поцеловались, но твой разум не смог вынести этой демонической энергии."
            g "Сначала ты попытался её облапать, потом полез в драку на бармена, а затем и вовсе заблевал всё вокруг."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Мда... она точно не это имела в виду, когда говорила, что хочет потусоваться как в былые времена."
            $ show_off("gs", .75)
            $ show_on("g1", .25)
            g "По крайней мере ты добрался домой, я думал, ты собираешься спать под лавкой."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "...."
            $ hide_char("g1")
            $ show_off("gs", .75)
            p "Сэр, прошу прощения, но у Вас есть одно новое сообщение, я посчитал, что оно достаточно важное."
            $ show_on("g1", .25)
            g "Не читай, вдруг это тебя ищут после вчерашнего, хотят расквитаться."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Ну говори, что там написано?"
            $ hide_char("g1")
            $ show_off("gs", .75)
            p "Кхе-кхе, судя по всему, это приглашение на собеседование от крупной компании на должность, которую Вы так хотели получить всё это время."
            p "Написано, что к ним в отдел кадров попало Ваше резюме, и они очень заинтересованы." 
            $ show_on("gs", .75)
            i "Шутишь!?"
            i "Ко-когда, когда собеседование."
            $ show_off("gs", .75)
            p "Сегодня, сэр."
            $ show_on("gs", .75)
            i "СЕЕЕЕЕГОДНЯЯ???"
            i "ЧТОООО ЗНААААЧИИИИИИИТ СЕГООООООДНЯ???"
            i "ВО СКОЛЬКО?"
            $ show_off("gs", .75)
            p "Через сорок минут, сэр."
            $ show_on("gs", .75)
            i "ТО ЕСТЬ ПРЯМО, МАТЬ ТВОЮ, СЕЙЧАС!!!"
            i "КАКОГО ЧЕРТА! Ты бесполезный кирпич, мог бы разбудить меня пораньше."
            $ show_off("gs", .75)
            p "Я делал всё что было в моих силах! Но Вы же знаете, голос у меня уже не тот что раньше."
            p "А Вы вдобавок были так мертвецки пьяны."
            $ show_on("gs", .75)
            i "Сраная шляпа, опять за старое, чего молчишь? Это твоих полей дело."
            $ show_off("gs", .75)
            f "Да забудь про шляпу, главное ты опять без ЖРАТВЫ вернулся."
            $ show_on("w1", .25)
            c "И без денег. Это предприятие стремительно идёт к финансовому коллапсу."
            $ hide_char("w1")
            $ show_off("w1", .25)
            f "Сведёшь так себя в могилу, а новый хозяин точно выкинет меня на свалку."
            $ show_on("gs", .75)
            i "Так, время... Сколько времени мне нужно чтобы добраться до туда?"
            $ hide_char("w1")
            $ show_off("gs", .75)
            $ show_on("g1", .25)
            g "Ты ведь не всерьез да? У тебя ноги трясутся словно холодец, а выглядишь ну прямо матёрый бомж, тебя и в офис то не пустят."
            $ hide_char("g1")
            $ show_on("w1", .25)
            c "Не вздумай слушать эту черную кляксу, возможность сгорит в любом случае, а если попытаешься, то хотя бы совесть твоя будет чиста."
            $ hide_char("w1")
            $ show_on("g1", .25)
            g "И опять выставишь себя на посмешище, ты и в лучшей форме ничего не добился, а сейчас на что рассчитывать?"
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Он прав, Гиря. Я сам себя до такого состояния довел, поэтому если облажаюсь, то хотя бы и винить кроме себя будет некого."
            $ hide_char("g1")
            $ show_off("gs", .75)
            $ show_on("n1", .25)
            n "История о превозмогании, о силе воли. У меня тут кое-что записано:"
            n "Можно кинуть камень в волка, но не волка в камень!"
            n "Простите, это не то…"
            n "Успех - это способность терпеть поражение за поражением, не теряя энтузиазма."
            $ hide_char("n1")
            $ show_on("w1", .25)
            c "Жаль только, что не ты это придумал."
            $ show_off("w1", .25)
            $ show_on("gs", .75)
            i "Так, я почти собрался, носки.... Где носки, ладно и без них нормально."
            i "Всё, нужно лететь... Бежать... Прыгать... ползти, что угодно но успеть."
            $ show_off("gs", .75)
        else: 
            '''
            {color=#0EA3C9}Несколько тревожных снов спустя.
            '''
            $ show_on("gs", .75)
            i "Снова проснулся один в своей одиночной квартире."
            $ show_off("gs", .75)
            p "Сэр, прошу прощения, но у Вас есть одно новое сообщение, я посчитал, что оно достаточно важное."
            $ show_on("g1", .25)
            g "Не читай, вдруг это опять те цыгане или мошенники."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Вот уж нашли, на кого время тратить."
            i "Ну говори, что там написано?"
            $ hide_char("g1")
            $ show_off("gs", .75)
            p "Кхе-кхе, судя по всему, это приглашение на собеседование от крупной компании на должность, которую Вы так хотели получить всё это время."
            p "Написано, что к ним в отдел кадров попало Ваше резюме, и они очень заинтересованы." 
            $ show_on("gs", .75)
            i "Шутишь!?"
            i "Ко-когда, когда собеседование."
            $ show_off("gs", .75)
            p "Сегодня, сэр."
            $ show_on("gs", .75)
            i "СЕЕЕЕЕГОДНЯЯ???"
            i "ВО СКОЛЬКО?"
            $ show_off("gs", .75)
            p "Через два часа, сэр."
            $ show_on("gs", .75)
            i "Фух, время есть чтобы привезти себя в порядок."
            $ show_off("gs", .75)
            $ show_on("w1", .25)
            c "Вселенная даёт тебе шанс, не упусти его."
            $ hide_char("w1")
            $ show_on("g1", .25)
            g "Вселенная в очередной раз насмехается, выманивает тебя как крота в игровом автомате, чтобы дать молотком по голове."
            $ hide_char("g1")
            $ show_on("n1", .25)
            n "Тот, кто зарывает голову в песок не видит страданий, но и счастья не видит тоже."
            $ show_off("n1", .25)
            $ show_on("gs", .75)
            i "Ладно, я готов к новой схватке."
            $ show_off("gs", .75)
            jump choise22

label choise22:
    $ hide_char("h1")
    "На самом деле сердце буквально выпрыгивает из груди, нужно взять что-то в качестве талисмана" 
    menu:
        "Часы":
            $ show_on("w1", .25)
            c "Хо-хо, наконец-то я вижу перед собой мужчину."
            $ show_off("w1", .25)
            $ show_on("gs", .75)
            i "Я всегда это отрицал, но в этот раз не помешает взять немного папиной удачи с собой."
            $ show_off("gs", .75)
            $ getjob = True
            jump Clock2

        "Записная книжка":
            $ show_on("gs", .75)
            i "Мне не стоило забывать о тебе, я думал все мои неудачи, из-за этой творческой меланхоличности."
            i "Но без этого от меня осталось ещё меньше." 
            $ show_off("gs", .75)
            $ show_on("n1", .25)
            n "Не сомневаюсь, ты поразишь их высотой полета своей мысли."
            n "И ты напишешь наконец в своей жизни счастливую главу."
            $ show_off("n1", .25)
            if hatmad:
                $ getjob = False
            else: 
                $ getjob = True
            jump notepad2

        "Шляпа":
            if hat_lost:
                scene bg divan
                $ show_on("gs", .75)
                i "Хмм... а куда я вчера шляпу закинул?"
                $ show_off("gs", .75)
                f "Когда ты приполз домой, ты был с непокрытой головой."
                $ show_on("g1", .25)
                g "Ты её оставил в баре, разумеется. И это к лучшему однозначно."
                $ show_off("g1", .25)
                $ show_on("gs", .75)
                i "Да жалко как-то, может, вернуться как-нибудь забрать."
                $ show_off("gs", .75)
                $ show_on("g1", .25)
                g "Не вздумай показываться там снова, тем более ты под конец использовал её вместо пакета для блевотины."
                $ show_off("g1", .25)
                $ show_on("gs", .75)
                i "Значит... Это конец наших отношений, прощай"
                $ show_off("gs", .75)
                jump choise22
            else:
                $ show_on("h1", .25)

                h "Эти вонючие офисные крысы в кой-то веки взбодрятся, едва завидят тебя!"
                $ show_off("h1", .25)
                $ show_on("gs", .75)
                i "Нет уж, я хочу увеличить свои шансы, а не умножить на ноль."  
                $ show_off("gs", .75)
                jump choise22
scene bg street
#ФОН УЛИЦА
label Clock2:
#sound of clock tic-tac fast
    play sound "audio/tick-tock.ogg"
#highpitch sound in the head
    play sound "audio/high_pitch.ogg"
#tense music
    $ show_on("w1", .25)
    c "Осталось 15 минут, нужно торопиться."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i  "Невозможно, с этой хреновиной невыносимо бежать."
    $ hide_char("w1")
    $ show_off("gs", .75)
    $ show_on("g1", .25)
    g "Снова я виноват, не нужно было вчера ужираться, пошел бы домой, сейчас было бы всё иначе."
    g "А если мы опоздаем? Тогда лучше не приходить вообще."
    $ hide_char("g1")
    $ show_on("w1", .25)
    c "Нытьё отставить, назад пути нет, ты будешь прорываться даже через закрытые двери."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "уф, хах, не могу больше бежать, нужно отдышаться."
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    c "Каждая секунда, потраченная бездеятельно - это еще один шаг к дефолту."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "Аргхх, если умру от остановки сердца, надеюсь, тебя закопают со мной."
    $ show_off("gs", .75)
    '''
    {color=#0EA3C9}"Двадцать триллионов шагов спустя"
    '''
    $ show_off("gs", .75)
    scene bg office
  #ФОН ОФИС
    $ show_on("w1", .25)
    c "Молодец, ты добрался."
    c "Теперь, позволь мне разобраться с этим."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "А ты сможешь?"
    $ show_off("gs", .75)
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    c "Ты сколько собеседований уже провалил? Доверься мне."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "Ты прав, хуже точно не будет."
    $ show_off("gs", .75)
    m "Следующий кандидат, входите!"
    $ hide_char("w1")
    $ show_on("g1", .25)
    g "Такой низкий тяжелый голос, как раскат грома."
    g "Он раздавит тебя, расплющит колоссальным пальцем саму твою суть."
    $ show_off("g1", .25)
    $ show_on("gs", .75)
    i "Одним провалом больше, одним меньше. Я уже привык, так что я иду."
    $ show_off("gs", .75)
    $ show_on("g1", .25)
    g "........"
    $ hide_char("g1")
    $ show_on("gs", .75)
    i "У тебя ведь всё равно нет выбора, раз уж ты прицепился."
    $ show_off("gs", .75)
    m "У меня не так много времени, быстрее, пожалуйста!"
    $ show_on("g1", .25)
    g "Ты только вглядись, он же сторониться тебя, твоего мерзотного запаха, твоей жалкой натуры."
    "СПУСТЯ 26 ТЫСЯЧ ВОПРОСОВ ИНТЕРВЬЮЕРА."
    $ hide_char("g1")
    $ show_on("w1", .25)
    c "Я же говорил, что всё пройдет как надо."
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "Он же еще не сказал, что меня взяли."
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    c "Это уже решенный вопрос, ты же заметил, КАК он это сказал?"
    c "Не это дежурное: 'Мы свяжемся с Вами', которое слышит каждый неудачник."
    c "Нет, это было: 'Мы В СКОРОМ ВРЕМЕНИ свяжемся с вами.'"
    $ show_off("w1", .25)
    $ show_on("gs", .75)
    i "Разница и правда есть."
    i "Теперь можно со спокойной душой возвращаться домой."
    $ show_off("gs", .75)
    $ show_on("w1", .25)
    c "Отдыхай, пока можешь, скорее в твоей жизни появится столько всего, что уже не продохнешь."
    $ hide_char("w1")
    $ show_on("g1", .25)
    g "Это ведь просто ужасно, столько стресса, как ты это выдержишь."
    $ show_off("g1", .25)
    $ show_on("gs", .75)
    i "Это уже будет другая история."
    $ show_off("gs", .75)
    jump ending

   #ФОН УЛИЦА
label notepad2:
        if hatmad:
            scene bg street
            $ show_on("n1", .25)
            n "Твоя голова идёт круг, пытаясь найти выход из болезненного лабиринта."
            n "Но неважно сколько усилий ты прилагаешь, всё тщетно."
            n "Ты и головная боль - одно отвратительное целое."
            $ hide_char("n1")
            $ show_on("g1", .25)
            g "Вот именно, и так всё очень плохо, так ты еще поперся на галгофу."
            $ hide_char("g1")
            $ show_on("n1", .25)
            n "Ты полон ненависти к себе, хочешь разорвать себя на куски и бросить псам."
            n "Поэтому ты идешь туда, где от тебя не оставят и кусочка."
            $ show_off("n1", .25)
            $ show_on("gs", .75)
            i "Да... Иду прямо в пасть к этим корпоротивным ублюдкам."
            i "Чтобы они еще раз вытерли об меня ноги, что я не закончил университет."
            i "Что я без опыта работы, что без связей."
            $ hide_char("n1")
            $ show_on("g1", .25)
            $ show_off("gs", .75)
            g "Хватит, это так страшно, пойдем назад, немедленно пойдем назад!"
            $ hide_char("g1")
            $ show_off("n1", .25)
            n "Назад идти было уже поздно, ведь на тебя уже упал взор Черной Башни."
            $ show_off("n1", .25)
            $ show_on("gs", .75)
            i "Чтож, это не займет много времени, я либо разорву их от ярости, либо паду к ногам от отчаяния."
            jump ending
        
        else:
      #ФОН УЛИЦА
            scene bg street
            $ getjob = True
            $ show_on("n1", .25)
            n "Ты идешь по улице, не замечая прохожих."
            n "Ты пробуешь на вкус, какого это быть в делах, спешить куда-то."
            n "Ты должен прийти на собеседование будучи таким же как они."
            n "Дыши их воздухом, смотри их глазами, чувствуй их сердцами."
            $ hide_char("n1")
            $ show_on("g1", .25)
            g "Я чувствую тревогу, ты не готов ни разу к собеседованию, просто взял и пошел."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "А что, я уже в поисках работы будто на самой работе."
            $ show_off("gs", .75)
            $ show_on("g1", .25)
            g "Не ври, я знаю, что ты боишься, что ты трясешься внутри."
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "И всё равно иду, и всё равно приду."
            $ hide_char("g1")
            $ show_on("n1", .25)
            n "Стеклянное здание возвышается надо мной, у его подножия я чувствую свою незначительность."
            n "Я трепещу перед людьми, что взирают на меня из глазниц этого гиганта."
            n "Трепещу и втайне желаю однажды так же смотреть свысока на других."
            $ hide_char("n1")
            $ show_on("g1", .25)
            g "Он прав, как ты будешь заходить внутрь? Ты же совершенно не похож на них, они прогонят тебя, или того хуже - сожрут!"
            $ show_off("g1", .25)
            $ show_on("gs", .75)
            i "Пускай подавятся тогда моим гнилым мясом"
            $ show_off("gs", .75)
        jump ending


label clock1:
  #ФОН УЛИЦА
scene bg street
$ show_on("g1", .25)
g "Мне здесь не нравится, может произойти, всё что угодно. Нужно было попросить кого-нибудь принести еды."
$ hide_char("g1")
$ show_on("gis", .25)
a "АУЧ"
a "Ой, прошу прощения, Вы в порядке."
a "Ах, неужели это ты?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Анна?"
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Да, ну точно ты, невероятно. Я думала, ты переехал! Кого не спрашивала, никто не знает, что ты да как."
$ hide_char("gis")
$ show_on("g1", .25)
g "Ты её знаешь? Такая ухоженная, такая яркая... откуда такому как ты её знать."
$ hide_char("g1")
$ show_on("w1", .25)
c "Они учились с этой девушкой в университете, она из богатой влиятельной семьи."
$ hide_char("w1")
$ show_on("g1", .25)
g "Не отвечай ей, сделай вид, что обозналась."
$ hide_char("g1")
$ show_on("gis", .25)
a "Тук-тук, здесь есть кто-нибудь?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Хах, ахахах, прости, просто я поражен тем, как ты изменилась."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "И как же?"
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Выгялидшь дорого, отличное сочетание денег и стиля."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Правда? Мне казалось, что я одеваюсь достаточно скромно."
$ hide_char("gis")
$ show_on("w1", .25)
c "Скромно как же, да каждое её движение кричит: 'Смотрите у меня куча ДЕНЕГ!'"
c "А вот у тебя всё прямо наоборот."
$ hide_char("w1")
$ show_on("gis", .25)
a "Слушай, у меня как раз есть свободное время, я шла выпить кофе, не хочешь со мной?"
a "Ну… если ты не занят, конечно."
$ hide_char("gis")
$ show_on("g1", .25)
g "Я ПРОТЕСТУЮ!"
g "куда, куда, куда…. в незнакомое место… Ты же её не видел уже столько лет, она красотка, а ты на себя посмотри."
$ hide_char("g1")
$ show_on("w1", .25)
c "Я бы честно предпочел, чтобы ты занялся более продуктивными делами, но иметь статную женщину всегда было престижно, её связи также могут иметь ценность в дальнейшем."
c "так что я помогу тебе составить заманчивое коммерческое предложение."
$ show_off("w1", .25)
$ show_on("gs", .75)
i "Вообще-то я тут по делам, но на тебя могу уделить часок."
$ show_off("gs", .75)
'''
{color=#0EA3C9}"Не так уж много шагов спустя."
'''
scene bg cafe
    #КАФЕХА ФОН
$ show_on("gis", .25)
a "Так ты живешь где-то неподалеку."
$ show_off("gis", .25)
$ show_on("gs", .75)
i  "Да, почти сразу же за углом у меня апартаменты."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Ух ты, тут такие милые домики, наверное, она очень уютная."
$ show_off("gis", .25)
$ show_on("gs", .75)
i "Настоящий дворец, не хватает только королевы."
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Вот как. Я очень рада, что у тебя дела идут хорошо."
a "А то ходили разные слухи… ну знаешь как это бывает."
$ hide_char("gis")
$ show_on("w1", .25)
c "Разузнай у неё побольше, информация самое ценное на рынке."
$ hide_char("w1")
$ show_on("g1", .25)
g "Иди скорее домой, здесь страшно, она видит тебя насквозь, видит какой ты неудачник на самом деле."
$ show_off("g1", .25)
$ show_on("gs", .75)
i "Что именно говорят? Ты же не веришь во всякие глупости, я надеюсь."
$ hide_char("g1")
$ show_on("gis", .25)
$ show_off("gs", .75)
a "Ты знаешь, мне никогда не было это интересно, просто слышала некоторое, то тут, то там."
$ hide_char("gis")
$ show_on("w1", .25)
c "Как же, её семья информационные магнаты, они знают всё обо всех, тебе нужно завладеть этой информацией и превратить её в золото!"
$ show_off("w1", .25)
$ show_on("gs", .75)
i "Ты же всегда была в центре внимания, наверняка тебе есть что рассказать."
i "После учебы у тебя точно карьера пошла в гору, работаешь в одном из этих роскошных офисах в кабинете на семидесятом этаже с панорамными окнами?"
$ hide_char("w1")
$ show_off("gs", .75)
$ show_on("gis", .25)
a "Ну… даже не знаю, мой кабинет не такой большой, а здание не такое высокое..."
$ hide_char("gis")
$ show_on("w1", .25)
c "Точно работает, корпоративная этика."
$ show_off("w1", .25)
$ show_on("gs", .75)
i "..."
$ hide_char("w1")
$ show_off("gs", .75)
$ show_on("gis", .25)
a "..."
$ hide_char("gis")
$ show_on("g1", .25)
g "Чувствуешь неловкое молчание? Это она думает, зачем она вообще тебя позвала куда-то, такого червяка."
$ hide_char("g1")
$ show_on("gis", .25)
a "Эм... подождешь меня минутку? Я отойду ненадолго"
$ hide_char("gis")
$ show_on("gs", .75)
i "Конечно, я пока позвоню своему партнеру по бизнесу, не торопись."
$ hide_char("gis")
$ show_off("gs", .75)
$ show_on("g1", .25)
g "Отлично, пока её нет надо валить, пока она не начала над тобой смеятся, пока все не начали."
$ hide_char("g1")
$ show_on("w1", .25)
c "Нельзя уходить посреди переговоров."
$ show_off("w1", .25)
$ show_on("gs", .75)
i "Зря я пришел сюда, глупо делать вид, что всё как раньше. Между нами пропасть, социальная пропасть."
$ show_off("gs", .75)
$ show_on("w1", .25)
c "Хм, я тоже почувствовал, не хочется признавать, но, вряд ли, ты чего-то добьешься здесь. Никто в здравом уме не станет вкладываться в такой ушербный проект."
$ hide_char("w1")
$ show_on("g1", .25)
g "Эти дурацкие часы впервые говорят что-то верное, пойдем скорее."
$ hide_char("g1")
$ show_on("w1", .25)
c "Если ты уходишь, то сохрани свой капитал, будем считать это небольшой финансовой аферой."
c "В результате которой, тебе достанется бесплатный кофе с эклером."
$ hide_char("w1")
$ show_on("g1", .25)
g "БЫСТРЕЕ ИДИ ДОМОЙ, ПОКА ОНА НЕ ВЕРНУЛАСЬ!"
$ show_off("g1", .25)
$ show_on("gs", .75)
i "Не могу поверить, что я действительно это делаю."
i "Но для неё это и правда должны быть копейки."
i "Прощай Анна, живи дальше в своём дворце, лучше бы ты просто прошла мимо."   
$ show_off("gs", .75)
$ show_on("g1", .25)
g "Только не оборачивайся, вдруг она заметила, будет так стыдно."
$ show_off("g1", .25)
scene bg street
  #УЛИЦА ФОН
'''
{color=#0EA3C9}"Семь наполненных стыдом минут спустя."
'''     
$ show_on("gs", .75)
i "Насколько же низко я опустился, за каких-то пять лет?"
$ show_off("gs", .75)
$ show_on("w1", .25)
c "Не вижу трагедии, ты остался в профите от этой встречи. Почувствовал запах нормальной жизни, побывал в кой-то веке в приличном месте, а твой баланс остался нетронутым."
$ show_off("w1", .25)
$ show_on("gs", .75)
i "Больше никогда не появлюсь на этом проспекте, чтобы не встретиться с ней случайно."
i "Если бы не папаня, то мы бы могли каждый день обедать вместе в люксовых заведениях."
$ show_off("gs", .75)
$ show_on("w1", .25)
c "Твой отец был хорошим человеком и гениальным бизнесменом, он дал своей семье всё."
$ show_off("w1", .25)
$ show_on("gs", .75)
i "Только вот бизнес его прогорел, а мы с мамой остались банкротами с кучей долгов."
i "Ладно бы это, но он еще и помереть через полгода умудрился, так и не проплатив до конца за моё обучение, куда сам же и отправил."
i "И вот теперь где я оказался, сбегаю из кафе, чтобы не отдавать свои последние копейки и не умереть с голоду"
$ show_off("gs", .75)
$ show_on("w1", .25)
c "Не смей винить в этом своего отца! Он высылал тебе столько денег все эти годы, что на них уже целое состояние можно было сколотить. Но ты всё спускал в трубу."
c "А эта девушка? Она предлагала попросить за тебя свою семью, чтобы оплатить твой последний год учебы, но ты отказался."
c "И это было бы достойным поступком, если бы у тебя был какой-то план, но твой план это оказаться в глубоком дерьме с еще более глубокодерьмовыми перспективами."
$ show_off("w1", .25)
$ show_on("gs", .75)
i "Я хотел, чтобы они видели во мне равного. Тогда я поступил так, как мой отец хотел бы чтобы я поступил."
$ show_off("gs", .75)
$ show_on("w1", .25)
c "И он бы восстал как феникс, а ты просто бледная тень! И вместо унизительных десяти минут тогда, ты выбрал десять тысяч сейчас."
$ hide_char("w1")
$ show_on("g1", .25)
g "Не говори так, он живет спокойную и безопасною жизнь, это является главной ценностью, а не твои отравляющие грёзы."
g "Какой смысл воротить прошлое, от него нужно держаться подальше."
$ show_off("g1", .25)
jump event_job
#scene bg divan
#КОМНАТА ФОН
label ending:
    scene bg divan
    '''
    {color=#0EA3C9}"Две недели спустя"
    '''
    if anna_love:
        "В комнате больше никиго не было"
        "Один за одним голоса замолчали" 
        jump goodending1
    else: 
        "В комнате больше никиго не было."
        "Один за одним голоса замолчали." 
        "Нет, кто-то в ней всё же был."
        $ show_on("gs", .75)
        i "В последнее время я слышу только тебя."

        $ show_off("gs", .75)
        $ show_on("g1", .25)
        g "Я не оставлю тебя одного, покуда ты во мне нуждаешься"
        g "Каким бы жалким, слабым ты себя не считал, я люблю тебя."
        $ show_off("g1", .25)
        $ show_on("gs", .75)
        i "Я знаю... Я знаю. С самого начала это был я, кто прицепил гирю к своей ноге."
        i "Чтобы иметь оправдание, чтобы не испытывать больше боли."
        i "Спрятаться от всего на самом дне."
        $ show_off("gs", .75)
        jump normalend
    
     
label goodending1:
    "Я всё еще привыкал, что дома было так светло."
    "Всё потому, что я помыл окна, выкинул старые затхлые шторы, и свету больше ничего не препятствовало."
    "Ему больше не препятствовало моё желание жить во мраке."
    "Стук в дверь"
    "Внезапный звук не пугает меня, наоборот я его предвкушал"
    "Уверенно дергаю ручку, по ту сторону ожидаемо оказывается блистательная девушка."
    $ show_on("gs", .75)
    i "Я как раз варю нам кофе, заходи."
    $ show_off("gs", .75)
    $ show_on("gis", .25)
    a "Вау, с каких пор ты не лежишь еще в трусах в это время?"
    $ show_off("gis", .25)
    $ show_on("gs", .75)
    i "Примерно со вчера, если тебя интересует точно время."
    $ show_off("gs", .75)
    $ show_on("gis", .25)
    a "Пахнет здорово, ты ведь раньше часто варил кофе, когда мы компанией выбиралсь в загородний дом моих родителей."
    $ show_off("gis", .25)
    $ show_on("gs", .75)
    i "Да, но я делаю это только для кого-то. Ради себя мне стоять у плиты сторожить его слишком лениво."
    $ show_off("gs", .75)
    $ show_on("gis", .25)
    a "Знаешь, я люблю тебя."
    a "Знаю, это немного внезапно... мы не так давно снова начали общаться, но когда ты рядом всё совсем по-другому."
    a "Я не могу перестать улыбаться как полня дура!"
    $ show_off("gis", .25)
    $ show_on("gs", .75)
    i "Я тоже тебя люблю, если бы ты видела, что я из себя представлял пока не встретил тебю, что творилось у меня в голове - ты бы ужаснулась."
    $ show_off("gs", .75)
    
    if getjob:
        $ show_on("gs", .75)
        y "Знаешь, я последние пять лет ходил с огромной гирей на ноге."
        y "И только вчера когда я проснулся её не было рядом."
        y "Сколько бы я не искал, она исчезла."
        y "Исчезла навсегда."
        y "Пей свой кофе и поедем на работу, это ты вся такая важная можешь позволить себе хоть в полдень заявиться."
        y "А я не хочу начать свою карьеру с такого аккорда."
        $ show_off("gs", .75)
        $ show_on("gis", .25)
        a "Ого, ты всё же действительно повзрослел."
        a "Значит я всё-таки не откопала артефакт из прошлого."
        $ show_off("gis", .25)
        y "Я так долго просто сидел и сжег спички, пока бежали дни."
        y "Но для меня наконец наступил завтрашний день."
    else:
        $ show_on("gs", .75)
        y "Знаешь, я последние пять лет ходил с огромной гирей на ноге."
        y "Она и сейчас где-то прячется, ждёт когда я снова буду в ней нуждаться."
        y "Но надже если такой день настанет, я больше не буду просто прятаться за ней от мира."
        y "Я буду волочить её за собой даже в самую крутую гору."
        $ show_on("gis", .25)
        $ show_off("gs", .75)
        a "Красиво сказано, а теперь давай собирайся уже."
        a "Я подброшу тебя, у тебя же собеседование в здании напротив моего офиса?"
        $ show_off("gis", .25)
        "Точно, снова собеседование, снова отказы."
        "Но с каждым разом я всё ближе к цели." 
        "Я больше не боюсь."

return
        
        
label normalend:
    if getjob:
        $ show_on("gs", .75)
        i "Но теперь всё не так очевидно, мне одиноко, но я больше не презираю себя."
        i "У меня появилась хорошая работа, и я с ней справляюсь."
        $ show_off("gs", .75)
        $ show_on("g1", .25)
        g "Но тебе тяжело, ты всё еще с опаской позволяешь себе мечтать о чем-то."
        g "Ты слишком привык сидеть в болоте, ведь здесь спокойно, тихо."
        $ show_off("g1", .25)
        $ show_on("gs", .75)
        i "Однажды ты мне больше будешь не нужен."
        $ show_off("gs", .75)
        $ show_on("g1", .25)
        $ show_off("g1", .25)
        "Или однажды только я у тебя и останусь."
        $ show_on("gs", .75)
        i "Пора идти, служебная машина уже приехала."
        i "Мне больше не тяжело, я буду волочить тебя за собой даже в самую крутую гору."
        $ show_off("gs", .75)
    else:
        $ show_on("g1", .25)
        g "Это конец."
        $ show_off("g1", .25)
        $ show_on("gs", .75)
        i "Это конец."
        $ show_off("gs", .75)
        $ show_on("g1", .25)
        g "Я больше никогда не хочу выходить из этой комнаты."
        $ show_off("g1", .25)
        $ show_on("gs", .75)
        i "Я больше никогда не хочу выходить из этой комнаты."
        $ show_off("gs", .75)
        x "Я клянусь, что остаток своих дней проведу в самом темном углу."
        x "Где свет не сможет больше обжечь меня."
        x "Где... Не будет... Меня."
     
return

